Tekla Open API Reference for Tekla Structures 2025
RebarProperties.BendingRadius Property
 Gets or sets the bending radius of the reinforcement.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double BendingRadius { get; set; }
Public Property BendingRadius As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
RebarProperties Class
Tekla.Structures.Model Namespace